# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
a = pd.Series(np.random.randint(1,4,100))
b = pd.Series(np.random.randint(1,3, 100))
c = pd.Series(np.random.randint(10000, 30000, 100))
print(a)
print()
print(b)
print()
print(c)

0     3
1     1
2     3
3     1
4     2
     ..
95    1
96    1
97    3
98    1
99    2
Length: 100, dtype: int32

0     1
1     1
2     2
3     2
4     2
     ..
95    2
96    2
97    2
98    2
99    2
Length: 100, dtype: int32

0     25582
1     27681
2     24067
3     14741
4     29281
      ...
95    10156
96    27525
97    26197
98    27980
99    13881
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([a,b,c], axis=1)
df

    0  1      2
0   3  1  25582
1   1  1  27681
2   3  2  24067
3   1  2  14741
4   2  2  29281
.. .. ..    ...
95  1  2  10156
96  1  2  27525
97  3  2  26197
98  1  2  27980
99  2  2  13881

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       3       1            25582
1       1       1            27681
2       3       2            24067
3       1       2            14741
4       2       2            29281
..    ...     ...              ...
95      1       2            10156
96      1       2            27525
97      3       2            26197
98      1       2            27980
99      2       2            13881

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
bigcolumn = pd.concat([a,b,c])
bigcolumn

0         3
1         1
2         3
3         1
4         2
      ...
95    10156
96    27525
97    26197
98    27980
99    13881
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [9]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
bigcolumn.reset_index(inplace=True, drop=True)
bigcolumn

0          3
1          1
2          3
3          1
4          2
       ...
295    10156
296    27525
297    26197
298    27980
299    13881
Length: 300, dtype: int32